app/controllers/attribs_controller.rb

SELECT "attribs".* FROM "attribs"
---
  def index
    attribs = Attrib.all