app/controllers/bodies_controller.rb

  def index
    bodies = Body.all
---
SELECT "bodies".* FROM "bodies"