app/controllers/collections_controller.rb

  def index
    collections = Collection.all
---
SELECT "collections".* FROM "collections"

  def create
    collection = Collection.create(collection_params)
---
INSERT INTO "collections" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test Collection"], ["user_id", 7], ["created_at", "2020-02-07 06:13:53.184205"], ["updated_at", "2020-02-07 06:13:53.184205"]]