app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests"
---
  def index
    requests = Request.all

SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
---
  def show
    request = Request.find(params[:id])

INSERT INTO "requests" ("title", "method", "url", "collection_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test Request"], ["method", "POST"], ["url", "http://example.com/test"], ["collection_id", 13], ["created_at", "2020-02-07 17:02:45.867726"], ["updated_at", "2020-02-07 17:02:45.867726"]]
---
  def create
    request = Request.create(request_params)

SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
UPDATE "requests" SET "title" = $1, "method" = $2, "url" = $3, "updated_at" = $4 WHERE "requests"."id" = $5  [["title", "Test Update"], ["method", "PATCH"], ["url", "http://example.com/test_update"], ["updated_at", "2020-02-07 17:58:19.957014"], ["id", 61]]
---
  def update
    request = Request.find(request_params[:id])
    request.update(request_params)